{"score":{"c1e4o":7.0,"c5vr3":3.0,"c5zhh":-9.0,"c6f76":3.0,"c7k9e":6.0,"caq3n":3.0,"cc2zi":3.0,"ccbf5":-2.0,"ccj8h":4.0,"ccomo":0.0,"cdijf":2.0,"cdnbm":1.0,"cdz4y":0.0,"cjw38":14.0,"ck4t2":1.0,"ckhyv":2.0,"ckmev":0.0,"coapq":1.0,"cq94w":1.0,"cqvos":13.0,"cqzof":-1.0,"cscqc":0.0,"csg6t":1.0,"ct06o":1.0,"ctevk":10.0,"ctey5":1.0,"ctf42":1.0,"ctjsh":1.0,"ctjsp":1.0,"ctmr8":5.0,"ctmrp":1.0,"ctpnb":4.0,"cueai":17.0,"cufzw":4.0,"cut8s":1.0,"cvgb0":2.0,"cvx2y":0.0,"cw72c":-1.0,"cw8ry":1.0,"cwktt":2.0},"controversiality":{"c1e4o":0.0,"c5vr3":0.0,"c5zhh":0.0,"c6f76":0.0,"c7k9e":0.0,"caq3n":0.0,"cc2zi":0.0,"ccbf5":0.0,"ccj8h":0.0,"ccomo":0.0,"cdijf":0.0,"cdnbm":0.0,"cdz4y":0.0,"cjw38":0.0,"ck4t2":0.0,"ckhyv":0.0,"ckmev":0.0,"coapq":0.0,"cq94w":0.0,"cqvos":0.0,"cqzof":0.0,"cscqc":0.0,"csg6t":0.0,"ct06o":0.0,"ctevk":0.0,"ctey5":0.0,"ctf42":0.0,"ctjsh":0.0,"ctjsp":0.0,"ctmr8":0.0,"ctmrp":0.0,"ctpnb":0.0,"cueai":0.0,"cufzw":1.0,"cut8s":0.0,"cvgb0":0.0,"cvx2y":0.0,"cw72c":0.0,"cw8ry":0.0,"cwktt":1.0},"subreddit":{"c1e4o":"reddit.com","c5vr3":"reddit.com","c5zhh":"reddit.com","c6f76":"reddit.com","c7k9e":"reddit.com","caq3n":"reddit.com","cc2zi":"reddit.com","ccbf5":"reddit.com","ccj8h":"reddit.com","ccomo":"reddit.com","cdijf":"programming","cdnbm":"reddit.com","cdz4y":"reddit.com","cjw38":"reddit.com","ck4t2":"programming","ckhyv":"reddit.com","ckmev":"reddit.com","coapq":"reddit.com","cq94w":"reddit.com","cqvos":"reddit.com","cqzof":"reddit.com","cscqc":"reddit.com","csg6t":"reddit.com","ct06o":"reddit.com","ctevk":"reddit.com","ctey5":"reddit.com","ctf42":"reddit.com","ctjsh":"reddit.com","ctjsp":"reddit.com","ctmr8":"reddit.com","ctmrp":"reddit.com","ctpnb":"programming","cueai":"reddit.com","cufzw":"reddit.com","cut8s":"reddit.com","cvgb0":"reddit.com","cvx2y":"reddit.com","cw72c":"reddit.com","cw8ry":"reddit.com","cwktt":"reddit.com"},"body":{"c1e4o":"The article raises concerns that a single speed Bluray drive will be too slow, but no one has even announced a single speed Bluray drive. Most of them are 4x so far. Since there aren't even singel speed drives available, it seems unlikely Sony would use them.\r\n\r\nWhen it comes to costs, a large part of the investment has already been made, fabs and developing the Cell processor together with IBM and Toshiba.\r\n\r\nSony makes tons of money off the Playstation and Microsft loses billions on the xbox. To assume Sony would can it's bestseller seems a little weird. Especially since both companies think their consoles are the key to gain dominance in the livingroom.","c5vr3":"&gt;What makes Nintendo Wii special and different from the XBOX 360 and PS3 is the motion sensing controller(or wiimote).\r\n\r\nIs the software stupid. What makes the Nintendo units special in my view is the software. Where the pobox (xbox) &amp; ps2 goes for the older gamers, Nintendo does a good job supplying games younger players can play. Thus concentrating on a segement that Sony touches on and Microsoft so far has ignored.","c5zhh":"I don't know about you fags, but I've never been more excited about gaming, and I've had every gaming system since 1983.\r\n\r\nUnless you own an xbox360, stfu, because you really have no clue what you are talking about.\r\n","c6f76":"\"I'm really not the dirty, xbox live cheater that you probably think i am! im just a weeeee little 13 year old. (and very hansom at that might i add. any waay\"\r\n\r\nCertainly says a lot of the guys at  Microsoft and Bungie ;-)","c7k9e":"An interesting compairison I've seen, even within the middle class is people my age group self-seperating by educational status. I know people who are my age (25) who didn't go to college and work an hourly job, and people my age that are salaried. The aspirations are different. One group spends most of its free time just trying to have the most fun for their buck -- xbox, movies, mary jane, while the other group talks about investing, grad school, and expensive gadgets we still can't possibly afford but lust for. \r\n\r\nI'd sort of scared of introducing my friends who I like hanging out with that didn't go to college to the ones who did, but I have a feeling both side wouldn't relate beccause they have different perceptions of what is normal and mature for our age. The college educated group forgets that their parents had to work hard and sacrifice to send to them to college so they could compete in the modern world, and not everyone has parents so dedicated to their children, or fortunate parents.\r\n\r\nI guess I'm saying the middle class can get out of touch, too. Modded the article up. Feel free to mod me down.","caq3n":"I'd always wondered why the  SMB2 was so different from the original mario game.  Then a couple years ago I had learned that it was a totally different game with mario pasted into it.  By that time the game had been embedded into my psych enough to not really care, but it is a little disappointing. I'd never played the Lost Levels, but I have a modded xbox with about 800 SNES games so I'm hoping its in the pack.  As far as difficulty, although I beat it, the Doki Doki version I thought was the toughest SMB of them all.","cc2zi":"I \"work\" with them... and by work, I mean play X-Men: Legends for xbox all day every day. Well, someones gotta stop magneto.","ccbf5":"http:\/\/www.xbox3604free.com\/default.aspx?r=688394 http:\/\/freexbox360.com\/index.php?referral=614018 http:\/\/freexbox360.peel.com\/refer.php?l=xbx14405947lkskb http:\/\/xbox360s.freepay.com\/?r=31863486 http:\/\/www.giftconga.com\/?xrid=34364 http:\/\/freesonyplaystation.com\/index.php?referral=736804 http:\/\/freemacbookpro.com\/index.php?referral=630754","ccj8h":"Probably the same 50% that believe Saddam was involved with Al-Qaeda. The same 50% of non thinking individuals that went to vote with the bible in their hand. What can we do to change this effects of religious and political propaganda? In 50 years history book will picture us as the generation that was playing with the xbox and ps2 while the world was at war and the government transformed the country in a 1984 drama. How can we stop this?","ccomo":"Today the Splinter Cell community manager spoke to IGN and finally let out some good and some bad news. Apparently we will be recieving demos for PC and for Xbox360! Although the xbox360 version will be multiplayer only for the demo. Even cooler news however is that the release date isn't sometime during christmas.","cdijf":"John Carmack used Visual Studio back in 1999: http:\/\/slashdot.org\/games\/99\/10\/15\/1012230.shtml . \r\n\r\nI'm guessing he still does since I seem to remember reading something aboud him liking xbox 360's development tools. But maybe those tools have nothing to do with Visual Studio...\r\n","cdnbm":"Now I can buy my xbox without fear of ve outdated in a few months!","cdz4y":"A must for everybody that owns an xbox 360 or people in the market for one!  I just got my 2 games in the mail, wish I would have picked 4! Check it out.","cjw38":"The vast majority of the time I smoke weed, while not often, is when I'm doing something active. In moderation I find it helps me focus better and stay relaxed when golfing or playing baseball.\r\n\r\nOf course there are times when I'm being lazy at home playing the xbox or channel sufing and smoking a doobie is just another thing to do to enjoy my sloth.\r\n\r\nI am really getting annoyed with the media and their williness to imply corelation as causation.","ck4t2":"Graphics is already massively parallel, it's just that the graphics card handles it, so programmers don't need to care about it that much. The good graphics programmers care about it though, because enabling more parallel computations on the card leads to better performance.\r\n\r\nWhen the ps3 launces this november it will have 7 cores, and the xbox 360 has three. The PS2 has three processors (two vector units and on emain core). This is completely disregarding the graphics chips in the consoles which really constitute an extra core that truns a special sort of code, and the parallel tasks within the work done by the graphics card.","ckhyv":"It gets worse.  Click on to the [Japanese Xbox 360 site](http:\/\/assets.xbox.com\/ja-jp\/dododo\/).","ckmev":"xbox [screenshot](http:\/\/househacker.com\/crap\/ytmndxbox.JPG).","coapq":"don't need an xbox 360 to watch this one... pretty cool...  but he should have brought a bigger gun...","cq94w":"another braniac predicting the impending doom of a microsoft initiative!?! hm, seems i've heard similar tunes sung in the past...windows (every version), CE, VB, networking, IE, xbox, 360...and now zune! 'because of various missteps, this offering is sure to fail. lord knows microsoft never *improves* anything!'\r\n\r\nhold your breath for 3 years and see how zune's doing. personally i think it will be a wimax phone by that iteration, and will be doing great.","cqvos":"Another thing regarding the marketplace points or whatever they're called:\r\n\r\nYou can carry those points over to the xbox marketplace for your games, but on there Microsoft is making people pay for things like tutorials that have always been free in games.  So the connection between the zune and xbox live is just linking one shitty system to another, allowing you to get ripped off faster.","cqzof":"tbh, if you've ever bought points on xbox, you would know how that ACTUALLY works. You know how much it costs to buy points in bulk, so if you buy points you see the price, you spot the difference - if there is any.","cscqc":"Eh I hope my xbox isn't recalled, how do you tell if it is the first model or a subsequent model? Mine does seem to get pretty got but I stand it up and my house is pretty cool inside so it helps","csg6t":"what about games specialy for ps or xbox?","ct06o":"heh, should have said \"hold 'em\" but reddit doesn't like apostrophe's apparently..... anyway, yea, seems like this patch has had a negative effect on many xbox 360 owness. It deletes some game info from other XBLA games, as well as making Texas Hold 'Em unplayable over live.","ctevk":"I was always under the assumption that Nintendo never sold anything at a loss.  Ever.  I could be mistaken on this though.\r\n\r\nThe wii has never, and will never, be in the same league.  Nintendo saw two giants fighting a battle and decided to do something different.  It's like trying to compare a hummer and a jeep to a vw bug.  It's simply different. \r\n\r\nI've bitten Nintendo's magic apple and I'm fully taken in.  Graphics and raw cpu power don't matter.  The DS is deeply gutless and does just fine.  The games I spend most of my time on were made a decade ago.  It's all about the gameplay and not a lick about the graphics.\r\n\r\nMore power would be useful, but from an interview I heard with the designer their biggest goals were power consumption, efficency, and size.  The wii is more powerful than the old xbox, but not by much.  And if you look at the technical improvements they did focus on, they blow the competition away.\r\n\r\nIf Nintendo were to take away the profit they make on selling these things, I'd much rather they throw in a second controller than any more guts.","ctey5":"Just wait until the PS3 has been out for as long as the xbox360... then lets compare graphix","ctf42":"On the other hand, the wii has some really fun games and interesting new gameplay mechanics, and the xbox has... slightly prettier sequels to games we've all played dozens of copies of already.","ctjsh":"Gamer-news.org collects gamer news for all platforms, ps3, ps2, xbox, xbox360, pc, ds, wii and shows you all one one page so you dont have to crawl the pages yourself!","ctjsp":"Join the Ultimate Pro Evolution Soccer Fan site, as stated by Official Xbox Magazine 360.\r\n\r\nPlay in leagues and tournaments with our members over xbox live","ctmr8":"I remember this happening with Lasertag and other toy guns that were black in color... I guess a pro with wired controllers are that no one is going to suspect it's a gun.\r\n\r\nGood advice for any gangster right now is to get a xbox360 or wii instead of a ps3.","ctmrp":"After taking their sweet ass time Bungie has opened Halo3.com to take registrations for the Halo 3 beta. The site is going extremely slow, as the entire xbox live community must all be on there together, so get to it.","ctpnb":"while i appreciate msr's funding of some key members of the haskell community, i continue to conclude that msr represents one of the worst investments in research. for a company that literally spends billions on research, i can see no appreciable payout. certainly it hasn't spawned or changed anything game-changing for windows or xbox, both of which continue to follow evolutionary models (i.e. copy the competition) in their markets. as to search, apparently microsoft spends a lot of money researching this too. so why does msn search suck?\r\n\r\ni work for a microsoft competitor that likewise spends a lot of money on research, almost all of it wasted. all of these companies have visions of bell labs, but it just isn't happening. furthermore i find these \"labs\" alienate employees that are really putting money in the bank by creating a \"class hierarchy\" inside the company, which is oddly bogus since most of the researchers are in no danger of ever generating any revenue. and please do not reply with something like \"well thats the nature of research, it pays out 5% of the time\". no. reading papers and sitting on committees pays out 0% of the time. the 5% who do produce are the ones who do actual research, not just yap and chat.","cueai":"Hrm...could it be because most xbox live kiddies are 13?","cufzw":"&gt;I personally think a chick that’s gaming instantly gains a few cool points\r\n\r\nSure! I'd love to see more chicks playing fps! But how many people can afford a second xbox for their kitchen or laundry room?","cut8s":"When you look at this ebay auction, there’s nothing out of the ordinary that gets your attention. Seller has 100% feedback (but only one feedback) and that Xbox360 box looks like it is in MINT condition just like what the title says. And since this is definitely less then the price of a retail xbox360, let’s just bid on it and see if we win it. Well congratulations to AEONIS who’s winning bid won him a BOX of an XBOX360.","cvgb0":"I can relate to this video.  I have 200 gigs of video\/music on my PC,  I have 120 dvds (not including those I've burnt),  I have an xbox360 and a PS2.  I've got all this crap and after working a 10 hour day I'm usually so overwhelmed by the amount of choice I have that I end up watching TV and just going to sleep.","cvx2y":"Went googling, and got a few adverts for goodvibrations and the like :)\r\nBut this is a good example: [ignition coil](http:\/\/wiki.4hv.org\/index.php\/Ignition_Coil)\r\n\r\nCoolest, though, is a [Xbox rapid fire mod](http:\/\/www.hackaday.com\/2006\/06\/12\/xbox-rapid-fire-mod\/)","cw72c":"\"Population alone doesn't really matter. What matters is what percentage of the population are gamers.\"\r\n\r\nThis is doubly true. Everyone's talking about how suddenly their 60 year old grandma is gaming again, thanks to the Wii.\r\n \r\nIn Japan, their 60 year old grandma never _stopped_ gaming. She's always had a handheld GBA or GBA SP. Or a game capable cell phone. And I'm not talking about something pathetic like the Ngage. \r\n\r\nPeople in the US probably won't get it. Halo, despite how much it sucks as a game, will be dear to so many people because it was there when they had their first LAN party. They would bring over the xbox to a friend's house who had a spare TV, and go at it, 4 on 4. \r\n\r\nHard-core gamers (not me) have been doing LAN parties for the past 10-15 years, and it just caught on in America with the release of the Xbox and Halo. \r\n\r\nFirst gen games might not have any problems with load times, but its a little quick to write off the Wii as a no-load time system. Zelda for GC takes something like 4 blocks on my memory card. Splinter Cell: Double Agent, likes 67 blocks, and its load time is much larger. \r\n\r\nAnd having a hard drive for saves instead of having to buy bigger and bigger memory cards is going to factor in the cost of the wii: do you want an upfront cost, or do you want hidden costs in your system?\r\n","cw8ry":"Halo isn't a good game. Combat Evolved != no cover. Halo combined the gameplay of the original quake with the graphics of Bungie -- 5 years AFTER it was supposed to originally ship for the Mac (but got bought out by MS, ported to xbox, etc). \r\n\r\nHave you even played Halo 2 on Xbox live?\r\n\r\nGears of War is what Halo should've been. Gears of War allows for actual things like 'tactics' and 'force multipliers'. Just like Battlefields 1 and 2 and Call of Duty. \r\n\r\nThe whole run screaming at your enemy to club them to death when you've got a perfectly good machine gun in your arms is what made the game weak. Its for meatheads.","cwktt":"You are confusing a \"de facto\" standard with non-proprietary.\r\n\r\nWindows is entrenched, but that doesn't make it open. It's still a proprietary system, just like OS\/2, the Mac, or the Amiga. Non-proprietary refers to standards and platforms anyone can create, not ones anyone can build apps for. \r\n\r\nAnyone can create a POSIX compatible Linux distribution, but its nearly impossible to create a working copy of Windows or its libraries, including DirectX. WINE and similar projects try, but after 10 years, its all still in beta.\r\n\r\nIt would be easier to copy Mac OS X than copy Windows. Both, however, are still proprietary.\r\n\r\nThe point you have the most trouble with is understanding that DirectX is the technology MS uses to tie the gaming industry to Windows. If it supported OpenGL, it would have to compete on its own merits, rather than hiding behind its monopoly.\r\n\r\nBut screw facts, you are an MS fan! Mod a story down because you are  uninformed and ignorant, and because you like playing the freaking xbox. \r\n\r\nReddit can go the way of Digg."},"year":{"c1e4o":"2006","c5vr3":"2006","c5zhh":"2006","c6f76":"2006","c7k9e":"2006","caq3n":"2006","cc2zi":"2006","ccbf5":"2006","ccj8h":"2006","ccomo":"2006","cdijf":"2006","cdnbm":"2006","cdz4y":"2006","cjw38":"2006","ck4t2":"2006","ckhyv":"2006","ckmev":"2006","coapq":"2006","cq94w":"2006","cqvos":"2006","cqzof":"2006","cscqc":"2006","csg6t":"2006","ct06o":"2006","ctevk":"2006","ctey5":"2006","ctf42":"2006","ctjsh":"2006","ctjsp":"2006","ctmr8":"2006","ctmrp":"2006","ctpnb":"2006","cueai":"2006","cufzw":"2006","cut8s":"2006","cvgb0":"2006","cvx2y":"2006","cw72c":"2006","cw8ry":"2006","cwktt":"2006"},"month":{"c1e4o":"02","c5vr3":"05","c5zhh":"05","c6f76":"05","c7k9e":"06","caq3n":"07","cc2zi":"08","ccbf5":"08","ccj8h":"08","ccomo":"08","cdijf":"08","cdnbm":"08","cdz4y":"08","cjw38":"09","ck4t2":"09","ckhyv":"10","ckmev":"10","coapq":"10","cq94w":"11","cqvos":"11","cqzof":"11","cscqc":"11","csg6t":"11","ct06o":"11","ctevk":"12","ctey5":"12","ctf42":"12","ctjsh":"12","ctjsp":"12","ctmr8":"12","ctmrp":"12","ctpnb":"12","cueai":"12","cufzw":"12","cut8s":"12","cvgb0":"12","cvx2y":"12","cw72c":"12","cw8ry":"12","cwktt":"12"}}